In [46]:
import sys
print('Python version: {}'.format(sys.version))

import pandas as pd
print('pandas version: {}'.format(pd.__version__))

import matplotlib as plt
print('matplotlib version: {}'.format(plt.__version__))
%matplotlib inline

import matplotlib.pyplot as plt
      
import numpy as np
print('NumPy version: {}'.format(np.__version__))

Python version: 3.10.9 (main, Mar  1 2023, 12:20:14) [Clang 14.0.6 ]
pandas version: 1.5.3
matplotlib version: 3.7.0
NumPy version: 1.23.5

In [36]:
colors = pd.read_csv("/Users/slp22/code/Dataset_Marieth/colors.csv")

In [37]:
colors.head()

   id            name     rgb is_trans
0  -1         Unknown  0033B2        f
1   0           Black  05131D        f
2   1            Blue  0055BF        f
3   2           Green  237841        f
4   3  Dark Turquoise  008F9B        f

In [49]:
colors_missing_count = colors.isnull().sum()
colors_missing_count[0:]

id          0
name        0
rgb         0
is_trans    0
dtype: int64

In [41]:
sets = pd.read_csv("/Users/slp22/code/Dataset_Marieth/sets.csv")

In [42]:
sets.head()

  set_num                        name  year  theme_id  num_parts
0    00-1             Weetabix Castle  1970       414        471
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          2
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [52]:
sets_missing_counts = sets.isnull().sum()
sets_missing_counts[0:]

set_num      0
name         0
year         0
theme_id     0
num_parts    0
dtype: int64

In [53]:
themes = pd.read_csv("/Users/slp22/code/Dataset_Marieth/themes.csv")

In [54]:
themes.head()

   id            name  parent_id
0   1         Technic        NaN
1   2  Arctic Technic        1.0
2   3     Competition        1.0
3   4  Expert Builder        1.0
4   5           Model        1.0

In [63]:
themes_missing_counts = themes.isnull().sum()
themes_missing_counts[0:]

id             0
name           0
parent_id    111
dtype: int64

In [66]:
isna_parent_ID = themes[themes['parent_id'].isna()]
isna_parent_ID

      id          name  parent_id
0      1       Technic        NaN
21    22       Creator        NaN
49    50          Town        NaN
111  112        Racers        NaN
125  126         Space        NaN
..   ...           ...        ...
604  605  Nexo Knights        NaN
605  606   Angry Birds        NaN
606  607  Ghostbusters        NaN
607  608        Disney        NaN
609  610    Brickheadz        NaN

[111 rows x 3 columns]

In [58]:
inventories = pd.read_csv("/Users/slp22/code/Dataset_Marieth/inventories.csv")

In [59]:
inventories.head()

   id  version set_num
0   1        1  7922-1
1   3        1  3931-1
2   4        1  6942-1
3  15        1  5158-1
4  16        1   903-1

In [64]:
inventories_missing_counts = inventories.isnull().sum()
inventories_missing_counts[0:]

id         0
version    0
set_num    0
dtype: int64

In [68]:
parts = pd.read_csv("/Users/slp22/code/Dataset_Marieth/parts.csv")

In [69]:
parts.head()

  part_num                                               name  part_cat_id
0   0687b1                        Set 0687 Activity Booklet 1           17
1     0901  Baseplate 16 x 30 with Set 080 Yellow House Print            1
2     0902  Baseplate 16 x 24 with Set 080 Small White Hou...            1
3     0903     Baseplate 16 x 24 with Set 080 Red House Print            1
4     0904  Baseplate 16 x 24 with Set 080 Large White Hou...            1

In [71]:
parts_missing_counts = parts.isnull().sum()
parts_missing_counts

part_num       0
name           0
part_cat_id    0
dtype: int64